# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
import pandas as pd
import seaborn as sns
import numpy as np
import matplotlib
%matplotlib inline

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [5]:
temp = pd.read_csv('Temp_States.csv')

#### Print `temp`.

In [6]:
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [7]:
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [ ]:
"""
City and State are strings while temperature is a floating number 
"""

#### Select the rows where state is New York.

In [10]:
state_NewYork = temp[(temp['State']=='New York')]
state_NewYork

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [11]:
print("Average temperature in New York is: ", state_NewYork.mean())

Average temperature in New York is:  Temperature    10.740741
dtype: float64

#### Which states and cities have a temperature above 15 degrees Celsius?

In [21]:
temp_above15 = temp.loc[(temp['Temperature']>15)]
temp_above15

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [23]:
temp_above15_cities = temp['City'].loc[(temp['Temperature']>15)]
temp_above15_cities

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [27]:
temp_above15_below20_cities = temp['City'].loc[(temp['Temperature']>15) & (temp['Temperature']<20)]
temp_above15_below20_cities

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [29]:
temp.groupby(['State'])['Temperature'].agg(['mean', 'std'])

                  mean       std
State
Connecticut  15.833333  1.964186
New Jersey   21.111111  1.571348
New York     10.740741  8.133404

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [32]:
employees = pd.read_csv('employee.csv')
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the `employees` dataframe. Comment your results.

In [33]:
# checking for the datatypes

employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

#### What's the average salary in this company?

In [39]:
print("Average salary is:", employees['Salary'].mean())

Average salary is: 48.888888888888886

#### What's the highest salary?

In [40]:
print("The highest salary is:", employees['Salary'].max())

The highest salary is: 70

#### What's the lowest salary?

In [41]:
print("The lowest salary is:", employees['Salary'].min())

The lowest salary is: 30

#### Who are the employees with the lowest salary?

In [43]:
employees_lowest_salary = employees['Name'].loc[(employees['Salary']==employees['Salary'].min())]
employees_lowest_salary

1    Maria
2    David
Name: Name, dtype: object

#### Find all the information about an employee called David.

In [49]:
employee_david = employees[(employees['Name']=='David')]
employee_david

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [51]:
salary_david = employees['Salary'].loc[(employees['Name']=='David')]
salary_david

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [53]:
title_associate = employees[(employees['Title']=='associate')]
title_associate

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [54]:
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [55]:
employees.iloc[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [58]:
employee_associate_salary55 = employees['Name'].loc[(employees['Title']=='associate') & (employees['Salary']>55)]
employee_associate_salary55

7    Pedro
Name: Name, dtype: object

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [59]:
employees.groupby(['Years'])['Salary'].mean()

Years
1    35.000000
2    38.333333
3    55.000000
4    35.000000
7    60.000000
8    70.000000
Name: Salary, dtype: float64

####  What is the average salary per title?

In [61]:
employees.groupby(['Title'])['Salary'].mean()

Title
VP           70.000000
analyst      32.500000
associate    56.666667
Name: Salary, dtype: float64

####  Find the salary quartiles.

In [64]:
Q1 = employees['Salary'].quantile(0.25)
Q2 = employees['Salary'].quantile(0.5)
Q3 = employees['Salary'].quantile(0.75)

print("Q1 salary:", Q1)
print("Q2 salary:", Q2)
print("Q3 salary:", Q3)

Q1 salary: 35.0
Q2 salary: 55.0
Q3 salary: 60.0

#### Is the mean salary different per gender?

In [65]:
employees.groupby(['Gender'])['Salary'].mean()

Gender
F    47.5
M    50.0
Name: Salary, dtype: float64

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [68]:
employees.groupby(['Department']).agg(['min', 'mean', 'max'])

           Years               Salary
             min      mean max    min   mean max
Department
HR             2  4.666667   8     30  45.00  70
IT             1  4.500000   8     30  48.75  70
Sales          2  2.500000   3     55  55.00  55

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [84]:
employee_department = employees.groupby(['Department'])['Salary'].agg(['max','min'])

employee_department['dif_max_min'] = employee_department['max'] - employee_department['min']
employee_department

            max  min  dif_max_min
Department
HR           70   30           40
IT           70   30           40
Sales        55   55            0

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here